
function fallingImoji(){
    const foodEmojis = ["🍔", "🍕", "🍟", "🌭", "🍿", "🥐", "🍞", "🥞", "🧇", "🧀", "🍗", "🍖", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🍿", "🧂", "🥫", "🥚", "🧈",  "🥣", "🥗", "🥡", "🍱", "🍛", "🍜", "🍝", "🍠", "🍣", "🍤", "🍥", "🍙", "🍘", "🍚", "🥠", "🥮", "🍢", "🍡", "🍧", "🍨", "🍦", "🥧", "🧁", "🍰", "🎂", "🍮", "🍬", "🍫", "🍩", "🍪", "🌰", "🥜", "🍯", "🥛", "☕️", "🍵", "🥤", "🧃", "🧉", "🧊", "🥢", "🍽", "🍴", "🥄", "🥝", "🥥", "🍇", "🍈", "🍉", "🍊", "🍋", "🍌", "🍍", "🥭", "🍎", "🍏", "🍐", "🍑", "🍒", "🍓",  "🫒", "🫑", "🌽", "🥕", "🧅", "🧄", "🥬", "🥦", "🥑", "🍆", "🥔", "🥒", "🌶", "🫘", "🥜", "🍞", "🥐", "🥖", "🥨", "🥯", "🥞", "🧇", "🧀", "🍖", "🍗", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🥪", "🌮", "🌯", "🥙", "🧆", "🥚", "🍳", "🥘", "🍲", "🫕", "🥣", "🥗", "🍿", "🧈", "🧂", "🥫", "🍱", "🍘", "🍙", "🍚", "🍛", "🍜", "🍝", "🍠", "🍢", "🍣", "🍤", "🍥", "🥮", "🍡", "🥟", "🥠", "🥡", "🦀", "🦞", "🦐", "🦑", "🦪", "🍦", "🍧", "🍨", "🍩", "🍪", "🎂", "🍰", "🧁", "🥧", "🍫", "🍬", "🍭", "🍮", "🍯", "🍼", "🥛", "☕️", "🫖", "🍵", "🍶", "🍾", "🍷", "🍸", "🍹", "🍺", "🍻", "🥂", "🥃", "🥤", "🧋", "🧃", "🧉", "🧊", "🥢", "🍽", "🍴", "🥄", "🔪"];
    const body = document.querySelector("body");

    function createEmoji() {
        const emoji = document.createElement("div");
        emoji.classList.add("absolute", "text-2xl");
        emoji.style.left = `${Math.random() * 100}vw`;
        emoji.style.top = `-50px`;
        emoji.style.zIndex = `-1`;
        emoji.innerText = foodEmojis[Math.floor(Math.random() * foodEmojis.length)];
        body.appendChild(emoji);

        const animation = emoji.animate([
            { transform: `translateY(0px)` },
            { transform: `translateY(${window.innerHeight + 50}px)` }
        ], {
            duration: Math.random() * 3000 + 2000,
            easing: "ease-in",
        });

        animation.onfinish = () => {
            emoji.remove();
        };
    }

    setInterval(createEmoji, 300);
}

fallingImoji();
